module.exports.config = {
name: 'autosent',
version: '10.02',
hasPermssion: 0,
credits: 'MrTomXxX',
description: 'Set Karne Ke Bad Automatically Msg Send Karega',
commandCategory: 'group messenger',
usages: '[]',
cooldowns: 3
};
const nam = [{
timer: '12:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 10:00 P𝐌 ⏳              لَقَدْ خَلَقْنَا الْإِنسَانَ فِي أَحْسَنِ تَقْوِيمٍ   اور ہم نے اِنسان کو بڑا ہی خُوبصورت پیدا کیا ہے🖤               ──── •💜• ────']
},
{
timer: '1:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 11:00 P𝐌 ⏳               پھر وہ تمہاری من پسند چیز تمہارے تک لائے گا,مقررہ وقت پر اور پھر تم حیران رہ جاؤ گے_💯                 ──── •💜• ────']
},
{
timer: '2:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 12:00 A𝐌 ⏳             وَنَبْلُوكُمْ بِالشَّرِّ وَالْخَيْرِ فِتْنَةً °        ہم ضرور تمہیں اچھے اور بُرے حالات سے آزمائیں گے ❤️  ──── •💜• ────']
},
{
timer: '3:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 1:00 A𝐌 ⏳             وَ لَلۡاٰخِرَۃُ خَیۡرٌ لَّکَ مِنَ الۡاُوۡلٰی°📿❤️🕋     اور آخرت تمہارے لیے دنیا سے کہیں بہتر ھے❤✨ ──── •💜• ────']
},
{
timer: '4:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 2:00 A𝐌 ⏳             نماز قائم کرو اور اللٌٰه کی نافرمانی سے بچو، اسی کی طرف تم سمیٹے جاؤ گے" 🎀   ──── •💜• ────']
},
{
timer: '5:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 3:00 A𝐌 ⏳              ‏وَاعْبُدْ رَبَّكَ حَتّـٰى يَاْتِيَكَ الْيَقِيْنُ           اور اپنے رب کی عبادت کرتے رہو یہاں تک کہ تمہیں موت آجائے😊               ──── •💜• ────']
},
{
timer: '6:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 4:00 𝗔𝐌 ⏳              ﷽ -•👑أَلْھَاکُمُ التَّکَاثُرُ °      زیادہ کی چاہت نے تمہیں غافل کردیا🥀               ──── •💜• ────']
},
{
timer: '7:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 5:00 A𝐌 ⏳               دِن کی پہلی فتح فجر کی نماز ہے۔۔♥️🌸🥀       ہر وہ شخص بےوفا ہے جو نماز نہیں پڑھتا...🥺♥️💯           ──── •💜• ────']
},
{
timer: '8:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 06:00 A𝐌 ⏳          وَنَبْلُوكُمْ بِالشَّرِّ وَالْخَيْرِ فِتْنَةً °      ہم ضرور تمہیں اچھے اور بُرے حالات سے آزمائیں گے ❤️      ──── •💜• ────']
},
{
timer: '9:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 07:00 A𝐌 ⏳            وَنَبْلُوكُمْ بِالشَّرِّ وَالْخَيْرِ فِتْنَةً °         ہم ضرور تمہیں اچھے اور بُرے حالات سے آزمائیں گے ❤️         ──── •💜• ────']
},
{
timer: '10:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 08:00 Am ⏳            وَرَفَعْنَا لَكَ ذِكْرَكَ ○               میرے نبی ﷺ کا ذکر ہمیشہ بلند رہے گا🥰        ──── •💜• ────']
},
{
timer: '11:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 09:00 Am ⏳              اور ﷲ کے سوا نہ تو تمہارا کوئی دوست ہے اور نہ ہی کوئی مددگار ✨     ( *سورة البقرہ )(۱۰۷) 🥀🦋               ──── •💜• ────']
},
{
timer: '12:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 10:00 Am ⏳            وَلَلْآخِرَةُ خَيْرٌ لَّكَ مِنَ الْأُولَىٰ🌸          اور یقینا تیرے لیے انجام آغاز سے بہتر ہو گا💜               ──── •💜• ────']
},
{
timer: '01:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 11:00 A𝐌 ⏳            مَن لَّمْ يَجْعَلِ اللَّهُ لَهُ نُورًا فَمَا لَهُ مِن نُّورٍ     اور بات یہ ہے کہ جسے اللّٰه ہی نور نہ دے اس کے پاس کوئی روشنی نہیں ہوتی۔     ──── •💜• ────']
},
{
timer: '2:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 12:00 𝐏𝐌 ⏳              اِیَّاکَ نَعۡبُدُ وَ اِیَّاکَ نَسۡتَعِیۡنُ ؕ o       ہم تیری ہی عبادت کرتے ہیں اور تجھ ہی سے مدد مانگتے ہیں.. 💯❤️✨                 ──── •💜• ────']
},
{
timer: '3:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 1:00 𝐏𝐌 ⏳             لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا°        غم نہ کرو، اللّٰہ ہمارے ساتھ ہے, سورة التوبة✨           ──── •💜• ────']
},
{
timer: '4:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 2:00 𝐏𝐌 ⏳               اِنَّ اللّٰہَ مَعَ الصّٰبِرِیْنَ:          جان لو کہ اللہ صبر کرنے والوں کے ساتھ ہے۔📿🌸         ──── •💜• ────']
},
{
timer: '5:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 3:00 𝐏𝐌 ⏳             ا تٙرجُ اِلّا رٙبّٙکٙ🖤        اپنے رب کے علاوہ کسی سے اُمید مت رکھو  🦋✨           ──── •💜• ────']
},
{
timer: '6:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 4:00 𝐏𝐌 ⏳              ✨🌹 ۞ رَبَّنَـآ ءَاتِنَـا فِى الدُّنيَـا حَسَنَةً وَفِى الأَخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّـارِ              ──── •💜• ────']
},
{
timer: '7:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 5:00 𝐏𝐌 ⏳               قُل هُوَ الله أَحَدٌ ۝          کہو وہ اللہﷻ ایک ہے.❤                ──── •💜• ────']
},
{
timer: '8:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 6:00 𝐏𝐌 ⏳             ور جتنا سکون سجدے میں ہے,دنیا کے کسی کونے میں نہیں_♥️      سُبْحَانَ رَبِّیَ الْاَعْلٰی          ──── •💜• ────']
},
{
timer: '9:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 07:00 𝐏𝐌 ⏳             وَاِنَّ اِلٰی رَبِّکـــَ الْمُنْتَھیٰ     اور تمہاری آخری منزل اللّٰـــــہ ہے⁦🥀♥️🌍                  ──── •💜• ────']
},
{
timer: '10:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 08:00 𝐏𝐌 ⏳             ♡𝗔𝗭𝗔𝗡 is the m0st 𝗕𝗲𝗮𝘂𝘁𝗶𝗳𝘂𝗹 𝗦𝗼𝘂𝗻𝗱 in the 𝗪𝗼𝗿𝗹𝗱۔۔ 🥺🌎🫀•                  ──── •💜• ────']
},
{
timer: '11:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 09:00 P𝐌 ⏳             یعْلَمُ خَائِنَةَ الْأَعْيُن○ِ🌼       وہ نگاہوں کی خیانت کو بھی جانتا ہے♥🌸                ──── •💜• ────']
}];
module.exports.onLoad = o => setInterval(() => {
const r = a => a[Math.floor(Math.random()*a.length)];
if (a = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};
